In [142]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [143]:
df = pd.read_csv('titanic .csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [144]:
df.drop(['PassengerId', 'Name', 'Ticket', 'SibSp', 'Parch', 'Embarked', 'Cabin'], axis='columns', inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [145]:
target = df['Survived']
input = df.drop('Survived', axis=1)

In [146]:
df.dummy = pd.get_dummies(input.Sex)*1
df.dummy.head(3)

C:\Users\adity\AppData\Local\Temp\ipykernel_21232\3426673839.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.dummy = pd.get_dummies(input.Sex)*1

   female  male
0       0     1
1       1     0
2       1     0

In [147]:
inputs = pd.concat([input, df.dummy], axis=1)
inputs.drop('Sex', axis=1,inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [148]:
# isnull = inputs.isnull().sum()
inputs.Age.fillna(inputs.Age.mean(), inplace=True)

C:\Users\adity\AppData\Local\Temp\ipykernel_21232\775066333.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  inputs.Age.fillna(inputs.Age.mean(), inplace=True)

In [149]:
inputs.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [150]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs, target,test_size=0.2)

In [151]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()
model.fit(X_train, y_train)
model.score(X_test, y_test)

0.7932960893854749

In [152]:
y_test[:10]

793    0
104    0
192    1
374    0
447    1
182    0
440    1
448    1
829    1
78     1
Name: Survived, dtype: int64

In [153]:
model.predict(X_test[:10])

array([0, 0, 1, 1, 0, 0, 1, 1, 1, 0])